In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.randn(4,3), index= [1,2,3,4],
                 columns=list('ABC'))
df

          A         B         C
1 -0.055156 -0.829016  0.196655
2 -0.101225  0.182578  0.495012
3 -0.054897 -0.159653 -0.356336
4 -0.020712  0.850872  0.898821

In [3]:
display(df.sum())

A   -0.231990
B    0.044780
C    1.234153
dtype: float64

In [5]:
display(df.sum(axis='columns'))

1   -0.687517
2    0.576366
3   -0.570886
4    1.728980
dtype: float64

In [7]:
display(np.abs(df))

          A         B         C
1  0.055156  0.829016  0.196655
2  0.101225  0.182578  0.495012
3  0.054897  0.159653  0.356336
4  0.020712  0.850872  0.898821

In [10]:
display('Minimum Value=',df['A'].min())

'Minimum Value='

-0.10122473970770976

In [11]:
display('Maximum Value=',df['A'].max())

'Maximum Value='

-0.02071231919101631

In [12]:
display('Subtraction Result =',df['A'].max() - df['B'].min())

'Subtraction Result ='

0.8083041717940664

In [13]:
display('Subtraction Result =',df['B'].max() - df['C'].min())

'Subtraction Result ='

1.2072078587393205

In [ ]:
#Using Lambda for creating temporary function.

In [14]:
display(df)

          A         B         C
1 -0.055156 -0.829016  0.196655
2 -0.101225  0.182578  0.495012
3 -0.054897 -0.159653 -0.356336
4 -0.020712  0.850872  0.898821

In [16]:
d = lambda V:V.max() - V.min()
df2 = df.apply(d)
df2

A    0.080512
B    1.679889
C    1.255157
dtype: float64

In [22]:
display(df)
def d(V):
    maximum = V.max()
    minimum = V.min()
    return pd.Series([maximum - minimum])
df3 = df.apply(d)
display(df3)

          A         B         C
1 -0.055156 -0.829016  0.196655
2 -0.101225  0.182578  0.495012
3 -0.054897 -0.159653 -0.356336
4 -0.020712  0.850872  0.898821

          A         B         C
0  0.080512  1.679889  1.255157

In [23]:
def b(V):
    return pd.Series([V.max()-V.min()])
df4 = df.apply(b)
display(df4)

          A         B         C
0  0.080512  1.679889  1.255157

In [ ]:
#Sorting & Mapping

In [28]:
DF = pd.DataFrame(np.arange(8).reshape((2,4)), index=('Two', 'One'),
                 columns=['D','A','C','B'])
display(DF)
DF2 = DF.sort_index(axis=1)
display(DF2)
DF3 = DF.sort_index(axis=0)
display(DF3)

     D  A  C  B
Two  0  1  2  3
One  4  5  6  7

     A  B  C  D
Two  1  3  2  0
One  5  7  6  4

     D  A  C  B
One  4  5  6  7
Two  0  1  2  3

In [30]:
display(DF.sort_values(by='C'))

     D  A  C  B
Two  0  1  2  3
One  4  5  6  7

In [31]:
display(DF.rank(ascending=True))

       D    A    C    B
Two  1.0  1.0  1.0  1.0
One  2.0  2.0  2.0  2.0

In [32]:
display(DF.rank(ascending=False))

       D    A    C    B
Two  2.0  2.0  2.0  2.0
One  1.0  1.0  1.0  1.0

In [34]:
display(DF.rank(axis='columns'))

       D    A    C    B
Two  1.0  2.0  3.0  4.0
One  1.0  2.0  3.0  4.0

In [ ]:
#Unique Values

In [39]:
DFN = pd.DataFrame([[1.4,np.nan],[7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                   index= ['A','B','C','D'], columns= ['ONE', 'TWO'])
display(DFN)

    ONE  TWO
A  1.40  NaN
B  7.10 -4.5
C   NaN  NaN
D  0.75 -1.3

In [40]:
display(DFN['ONE'].unique(), DFN['TWO'].unique())

array([1.4 , 7.1 ,  nan, 0.75])

array([ nan, -4.5, -1.3])

In [43]:
display(DFN['TWO'].value_counts(), DFN['ONE'].value_counts())

-1.3    1
-4.5    1
Name: TWO, dtype: int64

0.75    1
1.40    1
7.10    1
Name: ONE, dtype: int64